SELECT A.goodspk, A.gnum, A.categorypk, A.gnm, A.price, A.quantity, A.rdt, B.categorynm AS category, AVG(revscore) AS avgscore, COUNT(revscore) AS countscore
FROM cookit_goods A 
LEFT JOIN cookit_goods_category B ON A.categorypk = B.categorypk 
LEFT JOIN cookit_review C ON A.goodspk = C.goodspk
WHERE A.categorypk
GROUP BY goodspk
ORDER BY price desc;


INSERT INTO cookit_goods_category(categorynm) 
VALUES
('매콤한맛'),
('짭짤한맛'),
('새콤한맛'),
('담백한맛'),
('이국적인맛'),
('얼큰한맛'),
('시원한맛');

INSERT INTO cookit_goods (gnum, categorypk, gnm, price, quantity)
VALUES 
(01000001, 1, '메뉴1',22000, 100),
(01000002, 1, '메뉴2',22000, 80),
(02000003, 2, '메뉴3',21000, 100),
(02000004, 2, '메뉴4',25000, 100),
(03000005, 3, '메뉴5',15000, 40),
(03000006, 3, '메뉴6',12000, 150),
(04000007, 4, '메뉴7',28000, 200),
(04000008, 4, '메뉴8',32000, 70),
(05000009, 5, '메뉴9',12000, 30),
(05000010, 5, '메뉴10',22000, 100),
(06000011, 6, '메뉴11',22000, 110),
(06000012, 6, '메뉴12',22000, 120),
(07000013, 7, '메뉴13',22000, 130),
(07000014, 7, '메뉴14',32000, 140),
(01000015, 1, '메뉴15',12000, 10),
(01000016, 1, '메뉴16',18000, 20),
(02000017, 2, '메뉴17',19000, 30),
(02000018, 2, '메뉴18',22000, 40),
(03000019, 3, '메뉴19',22000, 50),
(03000020, 3, '메뉴20',17000, 100),
(04000021, 4, '메뉴21',22000, 120),
(04000022, 4, '메뉴22',15000, 140),
(05000023, 5, '메뉴23',22000, 160),
(05000024, 5, '메뉴24',25000, 200),
(06000025, 6, '메뉴25',22000, 111),
(06000026, 6, '메뉴26',36000, 15),
(07000027, 7, '메뉴27',22000, 25),
(07000028, 7, '메뉴28',35000, 45);

INSERT INTO cookit_review (goodspk,userpk,revscore,revctnt)
VALUES
(1,1,3,'내용1'),
(1,1,5,'내용2'),
(1,1,2,'내용3'),
(2,1,3,'내용4'),
(2,1,1,'내용5'),
(2,1,3,'내용6'),
(3,1,4,'내용7'),
(3,1,4,'내용8'),
(3,1,4,'내용9'),
(4,1,5,'내용10'),
(4,1,5,'내용11'),
(4,1,5,'내용12'),
(1,1,3,'내용1'),
(1,1,5,'내용2'),
(1,1,2,'내용3'),
(2,1,3,'내용4'),
(2,1,1,'내용5'),
(2,1,3,'내용6'),
(3,1,4,'내용7'),
(3,1,4,'내용8'),
(3,1,4,'내용9'),
(4,1,5,'내용10'),
(4,1,5,'내용11'),
(4,1,5,'내용12'),
(1,1,3,'내용1'),
(1,1,5,'내용2'),
(1,1,2,'내용3'),
(2,1,3,'내용4'),
(2,1,1,'내용5'),
(2,1,3,'내용6'),
(3,1,4,'내용7'),
(3,1,4,'내용8'),
(3,1,4,'내용9'),
(4,1,5,'내용10'),
(4,1,5,'내용11'),
(4,1,5,'내용12');

